Repository: dungd200803btvn/IPA_testing
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Checkout
vi: Thanh toán

# welcome
source: Welcome to our app
vi: Chào mừng bạn đến với ứng dụng của chúng tôi

# write_review
source: Write a review
vi: Viết đánh giá

source: Submit
vi: Gửi

source: Save
vi: Lưu

# rating_hint
source: Rate the product
vi: Đánh giá sản phẩm

# comment_hint
source: Write your comment here...
vi: Viết đánh giá của bạn tại đây...

# add_photo
source: Add photo or video
vi: Thêm ảnh hoặc video

source: Anonymous review
vi: Đánh giá ẩn danh

source: Language setting
vi: Cài đặt ngôn ngữ

# vi
source: Vietnamese
vi: Tiếng Việt

# en
source: English
vi: Tiếng Anh

# hint_text_comment
source: What do you think about the style, fit, size, color?
vi: Bạn nghĩ như thế nào về kiểu dáng, độ vừa vặn, kích thước, màu sắc?

# choose_photo_library
source: Choose photo from gallery
vi: Chọn ảnh từ thư viện

# take_photo
source: Take a photo
vi: Chụp ảnh

# choose_video_library
source: Choose video from gallery
vi: Chọn video từ thư viện

# take_video
source: Record videos
vi: Quay video

# comment_success
source: You have successfully reviewed the product!
vi: Bạn đã đánh giá thành công sản phẩm!

# upload_photo_success
source: Posted photos successfully
vi: Đăng ảnh thành công

# upload_video_success
source: Posted video successfully
vi: Đăng video thành công

source: Description
vi: Mô tả

source: Show more
vi: Xem thêm

source: Less
vi: Thu gọn,

source: Review
vi: Đánh giá

# review_and_rating
source: Reviews & Ratings
vi: Đánh giá & Xếp hạng

source: Total Review:
vi: Tổng số lượt đánh giá, bình luận:

source: Zoom image
vi: Ảnh phóng to

# has_media
source: Have photos or videos
vi: Có ảnh hoặc video

source: Total
vi: Tất cả

# no_review
source: No reviews yet.
vi: Chưa có đánh giá nào

source: Delivered
vi: Đã giao

source: Repurchase
vi: Mua lại

source: Quantity
vi: Số lượng

# no_order
source: Whoops! No Orders Yet!
vi: Rất tiếc! Chưa có đơn đặt hàng nào!

# let_fill_it
source: Let\'s fill it
vi: Hãy thêm vào giỏ hàng

source: Total order value
vi: Tổng giá trị đơn hàng

source: Order
vi: Đơn hàng

# one_product
source: 1 product
vi: 1 Sản phẩm

# add_to_cart
source: Your product has been added to the cart
vi: Sản phẩm của bạn đã được thêm vào giỏ hàng

# process_order
source: Processing your Order
vi: Đang xử lý đơn đặt hàng của bạn

source: Payment Success
vi: Thanh toán thành công

# ship_soon
source: Your item will be shipped soon!
vi: Mặt hàng của bạn sẽ được vận chuyển sớm!

# warning_payment_cancel
source: Payment is canceled or incomplete. Please enter complete information and try again.
vi: Thanh toán bị hủy bỏ hoặc chưa hoàn thành. Vui lòng nhập đầy đủ thông tin và thử lại.

source: and
vi: và

source: Skip
vi: Bỏ qua

source: Done
vi: Xong

# tContinue
source: Continue
vi: Tiếp tục

# onBoardingTitle1
source: Choose your product
vi: Chọn sản phẩm của bạn

# onBoardingTitle2
source: Select Payment Method
vi: Chọn phương thức thanh toán

# onBoardingTitle3
source: Deliver at your door step
vi: Giao tận cửa

# onBoardingSubTitle1
source: Welcome to a World of Limitless Choices - Your Perfect Product Awaits!
vi: Chào mừng bạn đến với thế giới của sự lựa chọn vô hạn - Sản phẩm hoàn hảo của bạn đang chờ đợi!

# onBoardingSubTitle2
source: For Seamless Transactions, Choose Your Payment Path - Your Convenience, Our Priority!
vi: Để giao dịch mượt mà, hãy chọn phương thức thanh toán của bạn - Sự tiện lợi của bạn, ưu tiên của chúng tôi!

# onBoardingSubTitle3
source: From Our Doorstep to Yours - Swift, Secure, and Contactless Delivery!
vi: Từ cửa hàng chúng tôi đến cửa nhà bạn - Giao hàng nhanh chóng, an toàn và không tiếp xúc!

source: First Name
vi: Tên

source: Last Name
vi: Họ

source: Password
vi: Mật khẩu

source: New Password
vi: Mật khẩu mới

source: Username
vi: Tên đăng nhập

# phoneNo
source: Phone Number
vi: Số điện thoại

source: Remember Me
vi: Ghi nhớ đăng nhập

source: Forget Password?
vi: Quên mật khẩu?

source: Sign In
vi: Đăng nhập

source: Create Account
vi: Tạo tài khoản

source: or sign in with
vi: hoặc đăng nhập với

source: or sign up with
vi: hoặc đăng ký với

source: I agree to
vi: Tôi đồng ý với

source: Privacy Policy
vi: Chính sách bảo mật

source: Terms of use
vi: Điều khoản sử dụng

source: Verification Code
vi: Mã xác thực

source: Resend Email
vi: Gửi lại Email

source: Resend email in
vi: Gửi lại email sau

# loginTitle
source: Welcome back,
vi: Chào mừng trở lại,

# loginSubTitle
source: Discover Limitless Choices and Unmatched Convenience.
vi: Khám phá sự lựa chọn vô hạn và tiện ích vô song.

# signupTitle
source: Let’s create your account
vi: Hãy tạo tài khoản của bạn

# forgetPasswordTitle
source: Forget password
vi: Quên mật khẩu

# forgetPasswordSubTitle
source: Don’t worry sometimes people can forget too, enter your email and we will send you a password reset link.
vi: Đừng lo, đôi khi mọi người cũng có lúc quên, hãy nhập email của bạn và chúng tôi sẽ gửi cho bạn liên kết đặt lại mật khẩu.

# changeYourPasswordTitle
source: Password Reset Email Sent
vi: Đã gửi email đặt lại mật khẩu

# changeYourPasswordSubTitle
source: Your Account Security is Our Priority! We've Sent You a Secure Link to Safely Change Your Password and Keep Your Account Protected.
vi: Bảo mật tài khoản của bạn là ưu tiên của chúng tôi! Chúng tôi đã gửi cho bạn liên kết bảo mật để thay đổi mật khẩu một cách an toàn và bảo vệ tài khoản của bạn.

# confirmEmail
source: Verify your email address!
vi: Xác nhận địa chỉ email của bạn!

# confirmEmailSubTitle
source: Congratulations! Your Account Awaits: Verify Your Email to Start Shopping and Experience a World of Unrivaled Deals and Personalized Offers.
vi: Chúc mừng! Tài khoản của bạn đang chờ đợi: Hãy xác nhận email của bạn để bắt đầu mua sắm và trải nghiệm thế giới ưu đãi độc đáo và được cá nhân hóa.

# emailNotReceivedMessage
source: Didn’t get the email? Check your junk/spam or resend it.
vi: Không nhận được email? Kiểm tra mục thư rác/spam hoặc gửi lại.

# yourAccountCreatedTitle
source: Your account successfully created!
vi: Tài khoản của bạn đã được tạo thành công!

# yourAccountCreatedSubTitle
source: Welcome to Your Ultimate Shopping Destination: Your Account is Created, Unleash the Joy of Seamless Online Shopping!
vi: Chào mừng đến với điểm đến mua sắm tối ưu của bạn: Tài khoản của bạn đã được tạo, hãy tận hưởng niềm vui của mua sắm trực tuyến liền mạch!

source: Popular Products
vi: Sản phẩm phổ biến

# homeAppbarTitle
source: Good day for shopping
vi: Ngày mua sắm tốt lành

# process_request
source: Processing your request...
vi: Đang xử lý yêu cầu của bạn...

# snap
source: Oh Snap
vi: Ôi chao

# send_email
source: Email sent
vi: Email đã được gửi

# send_email_msg
source: Email link sent to reset your password
vi: Liên kết email đã được gửi để đặt lại mật khẩu của bạn

# login_process
source: Logging you in...
vi: Đang đăng nhập cho bạn...

# login_wrong
source: Wrong email or password
vi: Email hoặc mật khẩu không đúng

# process_info
source: We are processing your information
vi: Chúng tôi đang xử lý thông tin của bạn

# accept_privacy
source: Accept Privacy Policy
vi: Chấp nhận Chính sách bảo mật

# accept_privacy_msg
source: In order to create account, you must have to read and accept the Privacy Policy & Terms of Use
vi: Để tạo tài khoản, bạn phải đọc và chấp nhận Chính sách bảo mật & Điều khoản sử dụng

source: Congratulations
vi: Chúc mừng

# congratulations_msg
source: Your account has been created!Verify email to continue
vi: Tài khoản của bạn đã được tạo! Vui lòng xác nhận email để tiếp tục

# verify_email_msg
source: Please check your inbox and verify your email
vi: Vui lòng kiểm tra hộp thư và xác nhận email của bạn

# add_address
source: Add new address
vi: Thêm địa chỉ mới

source: Name
vi: Tên

source: Phone number
vi: Số điện thoại

source: Street
vi: Đường

source: Select Province
vi: Chọn tỉnh thành

source: Select District
vi: Chọn quận huyện

source: Select Commune
vi: Chọn phường xã

source: Error
vi: Lỗi

source: Address not found
vi: Không tìm thấy địa chỉ

# update_select_address
source: Updating selected address now, please wait...
vi: Đang cập nhật địa chỉ được chọn, vui lòng đợi...

# err_select_address
source: Error in selection
vi: Lỗi trong quá trình chọn

# add_address_success_msg
source: Your address has been saved successfully
vi: Địa chỉ của bạn đã được lưu thành công

source: Select Address
vi: Chọn địa chỉ

# update_in4
source: We are updating your information...
vi: Chúng tôi đang cập nhật thông tin của bạn...

# update_name
source: Your name has been updated
vi: Tên của bạn đã được cập nhật

source: Delete
vi: Xóa

source: Delete Account
vi: Xóa Tài Khoản

# delete_account_msg
source: Are you sure want to delete your account permanently? This action is not reversible and all of your data will be removed permanently
vi: Bạn có chắc chắn muốn xóa tài khoản của mình vĩnh viễn không? Hành động này không thể hoàn tác và tất cả dữ liệu của bạn sẽ bị xóa vĩnh viễn

source: Cancel
vi: Hủy

source: Complete
vi: Hoàn thành

# process
source: Processing
vi: Đang xử lý

source: Addresses
vi: Địa chỉ

# update_address
source: Updating address...
vi: Đang cập nhật địa chỉ...

# update_address_success_msg
source: The address has been updated successfully
vi: Địa chỉ đã được cập nhật thành công

source: Delete address...
vi: Đang xóa địa chỉ...

# delete_address_msg
source: Are you sure you want to delete this address?
vi: Bạn có chắc chắn muốn xóa địa chỉ này không?

# delete_address_success_msg
source: The address has been deleted successfully
vi: Địa chỉ đã được xóa thành công

# default_address
source: Set as default address
vi: Đặt làm địa chỉ mặc định

source: Edit address
vi: Chỉnh sửa địa chỉ

source: Change name
vi: Đổi tên

# change_name_msg
source: User real name for easy verification. This name will appear on several pages
vi: Tên thật của người dùng để dễ dàng xác minh. Tên này sẽ xuất hiện trên nhiều trang

# re_auth
source: Re-Authenticate User
vi: Xác thực lại người dùng

source: Verify
vi: Xác minh

source: Profile
vi: Hồ sơ

# profile_in4
source: Profile Information
vi: Thông tin hồ sơ

# personal_in4
source: Personal Information
vi: Thông tin cá nhân

# change_pro5_picture
source: Change Profile Picture
vi: Đổi ảnh đại diện

source: Gender
vi: Giới tính

source: Date of Birth
vi: Ngày sinh

# change_dob
source: Change Date of Birth
vi: Đổi ngày sinh

# change_dob_msg
source: Update your date of birth now
vi: Cập nhật ngày sinh của bạn ngay bây giờ

source: Change Gender
vi: Đổi giới tính

# change_gender_msg
source: Update your Gender
vi: Cập nhật giới tính của bạn

# change_phone
source: Change phone number
vi: Đổi số điện thoại

# change_phone_msg
source: Update your phone number
vi: Cập nhật số điện thoại của bạn

source: Change email
vi: Đổi email

# change_email_msg
source: Update your email
vi: Cập nhật email của bạn

# change_user
source: Change username
vi: Đổi tên người dùng

# change_user_msg
source: Update your username
vi: Cập nhật tên người dùng của bạn

source: Account
vi: Tài khoản

# account_in4
source: Account Information
vi: Thông tin tài khoản

# app_setting
source: App Settings
vi: Cài đặt ứng dụng

# my_address
source: My Addresses
vi: Địa chỉ của tôi

# my_address_msg
source: Set shopping delivery addresses
vi: Thiết lập địa chỉ giao hàng mua sắm

source: My Cart
vi: Giỏ hàng của tôi

# my_cart_msg
source: Add, remove products and move to checkout
vi: Thêm, xoá sản phẩm và chuyển sang thanh toán

# my_order
source: My Orders
vi: Đơn hàng của tôi

# my_order_msg
source: In progress and completed orders
vi: Đơn hàng đang tiến hành và đã hoàn thành

# my_coupon
source: My Coupons
vi: Mã giảm giá của tôi

# my_coupon_msg
source: List of all discounted coupons
vi: Danh sách tất cả các mã giảm giá

# my_language
source: My Languages
vi: Ngôn ngữ của tôi

# my_language_msg
source: Choose your favorite language
vi: Chọn ngôn ngữ yêu thích của bạn

# my_notification
source: My Notifications
vi: Thông báo của tôi

# my_notification_msg
source: Set any kind of notification messages
vi: Cài đặt các loại thông báo

source: Dark mode
vi: Chế độ tối

# dark_mode_msg
source: Change the background to light or dark
vi: Thay đổi nền sang sáng hoặc tối

source: Logout
vi: Đăng xuất

source: Select Quantity
vi: Chọn số lượng

source: Select Variation
vi: Chọn biến thể

# select_variation_err
source: Selected variation is out of stock
vi: Biến thể đã chọn đã hết hàng

# select_product_err
source: Selected product is out of stock
vi: Sản phẩm đã chọn đã hết hàng

source: Remove Product
vi: Xóa sản phẩm

# remove_product_msg
source: Are you sure you want to remove this product?
vi: Bạn có chắc chắn muốn xóa sản phẩm này không?

# remove_product_success
source: Product removed from the Cart
vi: Sản phẩm đã được xóa khỏi giỏ hàng

source: Select Payment Method
vi: Chọn phương thức thanh toán

# add_wishlist
source: Product has been added to the Wishlist
vi: Sản phẩm đã được thêm vào danh sách yêu thích

# remove_wishlist
source: Product has been removed to the Wishlist
vi: Sản phẩm đã được xóa khỏi danh sách yêu thích

source: Close
vi: Đóng

source: No address selected
vi: Chưa chọn địa chỉ

# in_stock
source: In of stock
vi: Còn hàng

# out_stock
source: Out of stock
vi: Hết hàng

source: Higher Price
vi: Giá cao nhất

source: Lower Price
vi: Giá thấp nhất

source: Sale
vi: Khuyến mãi

source: Newest
vi: Mới nhất

source: Popularity
vi: Phổ biến

source: Brand
vi: Thương hiệu

source: No Data Found!
vi: Không tìm thấy dữ liệu!

source: Products
vi: Sản phẩm

source: Suggest promotional products
vi: Gợi ý sản phẩm khuyến mãi

# suggest_products
source: See suggested products
vi: Xem sản phẩm gợi ý

source: Cart
vi: Giỏ hàng

# cart_empty
source: Whoops! Cart is EMPTY!
vi: Ôi không! Giỏ hàng trống!

# fill_cart
source: Let\'s fill it
vi: Hãy lấp đầy nó

source: Order Review
vi: Xem lại đơn hàng

# have_promo_code
source: Have a promo code? Enter here
vi: Có mã giảm giá? Nhập vào đây

# err_load_voucher
source: Error loading vouchers
vi: Lỗi khi tải voucher

# no_available_voucher
source: No available vouchers
vi: Không có voucher khả dụng

# voucher_has_been_used
source: This voucher has been used and cannot be used again
vi: Voucher này đã được sử dụng và không thể sử dụng lại

source: Apply
vi: Áp dụng

source: Applied
vi: Đã áp dụng

source: Subtotal
vi: Tạm tính

source: Net Total
vi: Tổng cộng

source: Shipping Fee
vi: Phí vận chuyển

source: Order Total
vi: Tổng đơn hàng

source: Voucher
vi: Khuyến mãi

source: Payment Method
vi: Phương thức thanh toán

source: Change
vi: Thay đổi

source: Shipping Address
vi: Địa chỉ giao hàng

source: Search in store
vi: Tìm kiếm trong cửa hàng

source: Search...
vi: Tìm kiếm...

source: Search Result
vi: Kết quả tìm kiếm

source: Popular Category
vi: Danh mục phổ biến

source: Status
vi: Trạng thái

source: Variation
vi: Biến thể

# variation_mes
source: The product has good quality and reasonable price, it is worth trying once
vi: Sản phẩm có chất lượng tốt và giá hợp lý, đáng để thử một lần

source: Price
vi: Giá

source: Stock
vi: Tồn kho

source: Home
vi: Trang chủ

source: Store
vi: Cửa hàng

source: Wishlist
vi: Danh sách yêu thích

source: Notification
vi: Thông báo

source: View all
vi: Xem tất cả

# add_cart
source: Add to cart
vi: Thêm vào giỏ hàng

# err_load_review
source: Error loading reviews
vi: Lỗi khi tải đánh giá

source: Loading...
vi: Đang tải...

source: Unknown...
vi: Không xác định...

source: Anonymous
vi: Ẩn danh

source: You might like
vi: Có thể bạn sẽ thích

source: Feature Brands
vi: Thương hiệu nổi bật

# wishlist_empty
source: Whoops! Wishlist is empty
vi: Ôi không! Danh sách yêu thích trống

# let_add_some
source: Let\'s add some
vi: Hãy thêm một số mục

source: Notification detail
vi: Chi tiết thông báo

source: Have read
vi: Đã đọc

source: Un read
vi: Chưa đọc

# no_notification
source: Don't have notifications
vi: Không có thông báo

# voucher_claimed_success
source: Voucher claimed successfully
vi: Nhận voucher thành công

# no_apply_voucher_msg
source: The value of net total is already 0, no need to apply additional vouchers
vi: Giá trị tổng đơn hàng đã là 0, không cần áp dụng thêm voucher

# no_apply_freeship
source: Shipping price is free, no need to apply this voucher anymore
vi: Phí vận chuyển đã miễn phí, không cần áp dụng voucher này nữa

# no_apply_mininum_value_voucher
source: The order value has not reached the minimum level to apply this voucher
vi: Giá trị đơn hàng chưa đạt mức tối thiểu để áp dụng voucher này

# voucher_used_success
source: Voucher used successfully!
vi: Sử dụng voucher thành công!

# no_apply_first_purchase_voucher
source: Voucher applies to first order only
vi: Voucher chỉ áp dụng cho đơn hàng đầu tiên

# no_apply_points-based_voucher
source: You do not have enough points to use a points-based voucher
vi: Bạn không có đủ điểm để sử dụng voucher dựa trên điểm thưởng

source: Claim
vi: Nhận

# claim_voucher_msg
source: Just collect this voucher
vi: Chỉ cần thu thập voucher này

source: Claimed
vi: Đã nhận

# claimed_voucher_msg
source: This voucher has already been claimed
vi: Voucher này đã được nhận

source: Used
vi: Đã sử dụng

# used_voucher_msg
source: This voucher has been used and cannot be claimed again
vi: Voucher này đã được sử dụng và không thể nhận lại

source: Expired
vi: Hết hạn

# expired_voucher_msg
source: This voucher has expired and cannot be claimed
vi: Voucher này đã hết hạn và không thể nhận

source: Vouchers List
vi: Danh sách voucher

# vouchers_history
source: Voucher usage history
vi: Lịch sử sử dụng voucher

source: Shipping & Store
vi: Vận chuyển & Cửa hàng

source: Empty Cart
vi: Giỏ hàng trống

# add_cart_warning
source: Add items in the cart in order to proceed
vi: Thêm các mặt hàng vào giỏ hàng để tiếp tục

# review_success_message
source: Reward points: Reviewing the product: {0} points
vi: Điểm thưởng: bình luận về sản phẩm: {0} điểm

# upload_photo
source: Uploaded {0} photo(s): {1} points
vi: upload {0} ảnh: {1} điểm

# upload_video
source: Uploaded {0} video(s): {1} points
vi: upload {0} video: {1} điểm

# get_point_success
source: Successfully receive bonus points
vi: Nhận điểm thưởng thành công

# review_success_message_end
source: Total increase by {0} points
vi: Tổng điểm thưởng tăng thêm {0} điểm

# my_bonus_point
source: My Bonus Points
vi: Điểm thưởng của tôi

# my_bonus_point_msg
source: Check and accumulate more reward points to make shopping more attractive
vi: Kiểm tra và tích lũy thêm thật nhiều điểm thưởng để việc mua sắm thêm hấp dẫn

source: Get bonus points
vi: Nhận điểm thưởng

# bonus_points_expire
source: Bonus points will expire on
vi: Điểm thưởng sẽ hết hạn vào

source: Hello
vi: Xin chào

source: Current bonus points
vi: Điểm thưởng hiện tại

source: Today checkin now
vi: Điểm danh hôm nay ngay

source: Today checkin success
vi: Điểm danh hôm nay thành công

# today_checkin_duplicate
source: Today has been checkin
vi: Hôm nay đã được điểm danh

# checkin_success_msg
source: Today checkin success, received {0} points
vi: Điểm danh hôm nay thành công, nhận được {0} điểm

# order_success
source: Order successful
vi: Đặt hàng thành công

# order_success_msg
source: Your order has been successfully placed on
vi: Đơn hàng của bạn đã được đặt thành công vào

source: Today
vi: Hôm nay

source: Day
vi: Ngày
